tiborsimon/embedded-tdd-headers/pic/pic16/pic16c642_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C642_H_
#define _PIC16C642_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define PORTB                         19
#define RB0                           20
#define RB1                           21
#define RB2                           22
#define RB3                           23
#define RB4                           24
#define RB5                           25
#define RB6                           26
#define RB7                           27
#define PORTC                         28
#define RC0                           29
#define RC1                           30
#define RC2                           31
#define RC3                           32
#define RC4                           33
#define RC5                           34
#define RC6                           35
#define RC7                           36
#define INTCON                        37
#define RBIF                          38
#define INTF                          39
#define T0IF                          40
#define RBIE                          41
#define INTE                          42
#define T0IE                          43
#define PEIE                          44
#define GIE                           45
#define PIR1                          46
#define CMIF                          47
#define CMCON                         48
#define CM                            49
#define CM0                           50
#define CM1                           51
#define CM2                           52
#define CIS                           53
#define C1OUT                         54
#define C2OUT                         55
#define OPTION_REG                    56
#define PS                            57
#define PS0                           58
#define PS1                           59
#define PS2                           60
#define PSA                           61
#define T0SE                          62
#define T0CS                          63
#define INTEDG                        64
#define nRBPU                         65
#define TRISA                         66
#define TRISA0                        67
#define TRISA1                        68
#define TRISA2                        69
#define TRISA3                        70
#define TRISA4                        71
#define TRISA5                        72
#define TRISB                         73
#define TRISB0                        74
#define TRISB1                        75
#define TRISB2                        76
#define TRISB3                        77
#define TRISB4                        78
#define TRISB5                        79
#define TRISB6                        80
#define TRISB7                        81
#define TRISC                         82
#define TRISC0                        83
#define TRISC1                        84
#define TRISC2                        85
#define TRISC3                        86
#define TRISC4                        87
#define TRISC5                        88
#define TRISC6                        89
#define TRISC7                        90
#define PIE1                          91
#define CMIE                          92
#define PCON                          93
#define nBOR                          94
#define nPOR                          95
#define nPER                          96
#define MPEEN                         97
#define VRCON                         98
#define VR0                           99
#define VR                            100
#define VR1                           101
#define VR2                           102
#define VR3                           103
#define VRR                           104
#define VROE                          105
#define VREN                          106

#endif // _PIC16C642_H_
